/**
 * @Author:      zhanghq
 * @DateTime:    2017-12-08 20:37:10
 * @Description: 地区列表
 * @Last Modified By:   zhanghq
 * @Last Modified Time:    2017-12-08 20:37:10
 */
import Mock from 'mockjs'

export default Mock.mock({
    'code': 1,
    'msg': 'success',
    'result': {
      'areaList': [
        {
          'name': '渝中区',
          'id': '500103',
          'oldId': '200103'
        },
        {
          'name': '渝北区',
          'id': '500112',
          'oldId': '200112'
        },
        {
          'name': '江北区',
          'id': '500105',
          'oldId': '200105'
        },
        {
          'name': '九龙坡',
          'id': '500107',
          'oldId': '200105'
        },
        {
          'name': '大渡口',
          'id': '500104',
          'oldId': '200105'
        },
        {
          'name': '沙坪坝',
          'id': '500106',
          'oldId': '200105'
        },
        {
          'name': '北部新区',
          'id': '500199',
          'oldId': '200105'
        },
        {
          'name': '北碚区',
          'id': '500109',
          'oldId': '200105'
        },
        {
          'name': '巴南区',
          'id': '500113',
          'oldId': '200105'
        },
        {
          'name': '南岸区',
          'id': '500108',
          'oldId': '200105'
        },
        {
          'name': '酉阳县',
          'id': '500242',
          'oldId': '200105'
        }, {
          'name': '奉节县',
          'id': '500236',
          'oldId': '200105'
        },
        {
          'name': '巫溪县',
          'id': '500238',
          'oldId': '200105'
        },
        {
          'name': '开州',
          'id': '500234',
          'oldId': '200105'
        },
        {
          'name': '彭水县',
          'id': '500243',
          'oldId': '200105'
        },
        {
          'name': '云阳县',
          'id': '500235',
          'oldId': '200105'
        },
        {
          'name': '万州区',
          'id': '500101',
          'oldId': '200105'
        },
        {
          'name': '江津区',
          'id': '500116',
          'oldId': '200105'
        },
        {
          'name': '石柱县',
          'id': '500240',
          'oldId': '200105'
        }, 
        {
          'name': '巫山县',
          'id': '500237',
          'oldId': '200105'
        },
        {
          'name': '涪陵区',
          'id': '500102',
          'oldId': '200105'
        },
        {
          'name': '丰都县',
          'id': '500230',
          'oldId': '200105'
        },
        {
          'name': '武隆县',
          'id': '500232',
          'oldId': '200105'
        },
        {
          'name': '南川区',
          'id': '500119',
          'oldId': '200105'
        },
        {
          'name': '秀山县',
          'id': '500241',
          'oldId': '200105'
        },
        {
          'name': '黔江区',
          'id': '500114',
          'oldId': '200105'
        },
        {
          'name': '合川区',
          'id': '500117',
          'oldId': '200105'
        },
        {
          'name': '綦江区',
          'id': '500222',
          'oldId': '200105'
        },
        {
          'name': '忠县',
          'id': '500233',
          'oldId': '200105'
        },
        {
          'name': '梁平区',
          'id': '500228',
          'oldId': '200105'
        },
        {
          'name': '永川区',
          'id': '500118',
          'oldId': '200105'
        },
        {
          'name': '垫江县',
          'id': '500231',
          'oldId': '200105'
        },
        {
          'name': '长寿区',
          'id': '500115',
          'oldId': '200105'
        },
        {
          'name': '大足区',
          'id': '500225',
          'oldId': '200105'
        },
        {
          'name': '铜梁区',
          'id': '500224',
          'oldId': '200105'
        },
        {
          'name': '荣昌区',
          'id': '500226',
          'oldId': '200105'
        },
        {
          'name': '璧山区',
          'id': '500227',
          'oldId': '200105'
        },
        {
          'name': '城口县',
          'id': '500229',
          'oldId': '200105'
        },
        {
          'name': '潼南县',
          'id': '500223',
          'oldId': '200105'
        }
      ]
    }
  })
